12/data/attachments/2be54240e22c09c6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d1312f10-2f27-468c-a685-2afde87b5468</nif:username>
            <nif:friendToBeAdded>Amanda_laugh_Friend_34049_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>